Revit 2027 API
RebarBarType.GetHookLength Method
 Identifies the hook length for a hook type
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetHookLength(
	ElementId hookId
)
Public Function GetHookLength (
	hookId As ElementId
) As Double
public:
double GetHookLength(
	ElementId^ hookId
)
member GetHookLength :
        hookId : ElementId -> float
Parameters
hookId ElementId
 id of the hook type
Return Value
Double
 The hook length for a hook type
Exceptions
Exception | Condition
ArgumentException |  the rebar hook type id hookId is not valid
ArgumentNullException |  A non-optional argument was null
Remarks
 If the AutoCalcHookLengths property is turned off, the default hook length will be returned
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace